CSI API ETABS v1

# cDetailingGetDetailedBeamLines Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDetailedBeamLines(
    	ref int NumberItems,
    	ref string[] BeamLineIDs
    )

    Function GetDetailedBeamLines (
    	ByRef NumberItems As Integer,
    	ByRef BeamLineIDs As String()
    ) As Integer

    Dim instance As cDetailing
    Dim NumberItems As Integer
    Dim BeamLineIDs As String()
    Dim returnValue As Integer

    returnValue = instance.GetDetailedBeamLines(NumberItems,
    	BeamLineIDs)

    int GetDetailedBeamLines(
    	int% NumberItems,
    	array<String^>^% BeamLineIDs
    )

    abstract GetDetailedBeamLines :
            NumberItems : int byref *
            BeamLineIDs : string[] byref -> int

#### Parameters

NumberItems

    Type: SystemInt32

BeamLineIDs

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cDetailing Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com